<?php 
for($i=1;$i<=9;$i++) {
	for($j=1;$j<=$i;$j++) {
		echo $i."* ".$j."= ".$i*$j;
	}
	echo "<br>";
}



	//1.打印1~100之间7的倍数；
	for($i = 1;$i<=100;$i++){
		if($i % 7 ==0){
			echo $i.'<br>';
		}
	}
	//2.打印1~100之间个位为7的数；
	for($j = 1;$j<=100;$j++){
		if($j%10==7){
			// echo $j.'<br>';
		}
	}
	//3.打印1~100之间十位为7的数
	for($k = 1;$k<101;$k++){
		if(intval($k/10) ==7){
			echo $k.'<br>';
		}
	}
	//4.打印1~100之间个位不为7以及十位不为7，以及不是7的倍数；
	for($i = 1;$i<=100;$i++){
		if(($i!=7) && ($i%10!=7) && (intval($i/10)!=7)){
			echo $i.'<br>';
		}
	}


 ?>